app/views/crud_controller/base/_form.html.erb

        <% if attribute == 'director_id' %>
            <b>Director Name</b> <%= f.collection_select :director_id, Director.all, :id, :DirectorName %>
---
SELECT `directors`.* FROM `directors`

        <% if attribute == 'video_id' %>
            <b>Title</b> <%= f.collection_select :video_id, Video.all, :id, :title %>
---
SELECT `videos`.* FROM `videos`

        <% if attribute == 'videoforrent_id' %>
            <b>Title</b> <%= f.collection_select :videoforrent_id, Videoforrent.all, :id, :video_id %><br>
            <b>Member</b> <%= f.collection_select :member_id, Member.all, :id, :full_name %>
---
SELECT `videoforrents`.* FROM `videoforrents`
SELECT `members`.* FROM `members`