app/views/videos/_form.html.erb

SELECT `directors`.* FROM `directors`
---
        <% if attribute == 'director_id' %>
            <b>Director Name</b> <%= f.collection_select :director_id, Director.all, :id, :DirectorName %>