app/views/videoforrents/_form.html.erb

SELECT `videos`.* FROM `videos`
---
        <% if attribute == 'video_id' %>
            <b>Title</b> <%= f.collection_select :video_id, Video.all, :id, :title %>