app/controllers/directors_controller.rb

INSERT INTO `directors` (`directorNo`, `DirectorName`) VALUES ('12', 'adfas')
---
    def create
        @object = Director.new(director_params)
        if @object.save