app/controllers/members_controller.rb

INSERT INTO `members` (`fName`, `lName`, `sex`, `DOB`, `address`, `dateJoined`) VALUES ('Karen', 'Parker', 'F', '1972-02-22', '22 Greenway Drive, Glasw, G12 8DS', '1991-01-06')
---
    def create
        @object = Member.new(member_params)
        if @object.save