app/controllers/videos_controller.rb

INSERT INTO `videos` (`title`, `certificate`, `category`, `dailyRental`, `price`, `director_id`) VALUES ('borrar', 'ASD', 'Terror', 5.0, 5.0, 1)
---
    def create
        @object = Video.new(video_params)
        if @video.save