app/views/rentalagreements/_form.html.erb

SELECT `members`.* FROM `members`
SELECT `videoforrents`.* FROM `videoforrents`
SELECT `videos`.* FROM `videos`
---
        <% if attribute == 'videoforrent_id' %>
            <b>Member</b> <%= f.collection_select :member_id, Member.all, :id, :full_name %><br>
            <b>Title</b> <%= f.collection_select :videoforrent_id, Videoforrent.all, :id, :title_copy %><br>
            <!-- <b>Title</b> <%# f.collection_select :videoforrent_id, (Video.all) join (Videoforrent.all), :id, :title %><br> -->